Ran Plan for dir: `EKS/VPC` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 1s [id=ap-southeast-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_internet_gateway.gw will be created
+ resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Main-IGW"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + tags_all = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Main-IGW"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.public will be created
+ resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Route-Table"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + tags_all         = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Route-Table"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[2] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.private[0] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Private-Subnet-0"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + tags_all                                       = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Private-Subnet-0"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Private-Subnet-1"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + tags_all                                       = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Private-Subnet-1"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[2] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Private-Subnet-2"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + tags_all                                       = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Private-Subnet-2"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Subnet-0"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + tags_all                                       = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Subnet-0"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Subnet-1"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + tags_all                                       = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Subnet-1"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[2] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Subnet-2"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + tags_all                                       = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Subnet-2"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.eks_vpc will be created
+ resource "aws_vpc" "eks_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "EKS-VPC"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + tags_all                             = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "EKS-VPC"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ igw_id              = (known after apply)
+ private_subnet_0_id = (known after apply)
+ private_subnet_1_id = (known after apply)
+ private_subnet_2_id = (known after apply)
+ public_subnet_0_id  = (known after apply)
+ public_subnet_1_id  = (known after apply)
+ public_subnet_2_id  = (known after apply)
+ vpc_cidr            = "10.0.0.0/16"
+ vpc_id              = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d EKS/VPC
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://dc5f6fc9bf6e:4141/lock?id=tampubolon%252Fdata-pipeline%252FEKS%252FVPC%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d EKS/VPC
  ```
Plan: 12 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```